一、简答题

1.用简短的语言给出对分析、设计的理解。
分析是指对问题和需求进行研究，而不是寻找解决方案，目的在于做对的事；设计是指在分析的基础上，寻找一个概念性的解决方案，而不是具体的解决方案，目的在于把事情做对。

2.用一句话描述面向对象的分析与设计的优势。
面向对象的分析与设计和人类的自然思考方式较相近。

3.简述UML（统一建模语言）的作用。考试考哪些图？
UML的作用是将分析与设计的结果可视化。考试考：概念类图，软件类图，实现类图。

4.从软件的本质角度，解释软件范围（需求）控制的可行性。
软件本身具有复杂性、一致性、可变性、不可视性四大特性，这些特性导致软件范围多数情况对客户和开发者是模糊的，即客户和开发方交流讨论后，也可能无法得出想要软件具体有哪些功能，因此，开发方可以去掉一些客户自身都没想清楚的业务，先根据一些清晰的功能需求做出可运行的产品，再逐渐完善。

二、项目管理实践

1.看板使用练习
![image](https://github.com/sunzh871041162/sunzh871041162.github.io/blob/master/kanban.png)

2.UML绘图工具练习
UML和模式应用(第3版)  P111，图9-10：
![image](https://github.com/sunzh871041162/sunzh871041162.github.io/blob/master/uml.png)
